app/Controllers/Seminarios/Capacitaciones/ListadoController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `mae_capacitaciones`.`id_mae_capacitacion`, `fecha_ini`, `fecha_fin`, `nombre_curso`, ifnull(count(d.id_mae_capacitacion), 0) as cantidad
FROM `mae_capacitaciones`
JOIN `cursos` as `c` ON `c`.`id_curso`= `mae_capacitaciones`.`id_curso`
LEFT JOIN `det_capacitaciones` as `d` ON `d`.`id_mae_capacitacion` = `mae_capacitaciones`.`id_mae_capacitacion`
GROUP BY `mae_capacitaciones`.`id_mae_capacitacion`, `d`.`id_mae_capacitacion`
) CI_count_all_results
SELECT `mae_capacitaciones`.`id_mae_capacitacion`, `fecha_ini`, `fecha_fin`, `nombre_curso`, ifnull(count(d.id_mae_capacitacion), 0) as cantidad
FROM `mae_capacitaciones`
JOIN `cursos` as `c` ON `c`.`id_curso`= `mae_capacitaciones`.`id_curso`
LEFT JOIN `det_capacitaciones` as `d` ON `d`.`id_mae_capacitacion` = `mae_capacitaciones`.`id_mae_capacitacion`
GROUP BY `mae_capacitaciones`.`id_mae_capacitacion`, `d`.`id_mae_capacitacion`
 LIMIT 5
---
    public function index()
    {
        $capacitacion  = new MaestroCapacitacionesModel();
        $capacitacionData = $capacitacion->select('mae_capacitaciones.id_mae_capacitacion,fecha_ini,fecha_fin ,c.nombre_curso,count(nombre_curso) as cantidad')
            ->join('cursos as c', 'c.id_curso= mae_capacitaciones.id_curso')
            ->join('det_capacitaciones as d', 'd.id_mae_capacitacion = mae_capacitaciones.id_mae_capacitacion')
            ->groupBy('mae_capacitaciones.id_mae_capacitacion , c.nombre_curso')
            ->paginate(5);