app/Controllers/Seminarios/CursosController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `cursos`.*, concat(f.nombres, " ", `f`.`paterno`, " ", f.materno) as nombre_facilitador, ifnull(count(m.id_curso), 0) as cantidad
FROM `cursos`
JOIN `facilitadores` as `f` ON `f`.`id_facilitador`= `cursos`.`id_facilitador`
LEFT JOIN `mae_capacitaciones` as `m` ON `m`.`id_curso` = `cursos`.`id_curso`
GROUP BY `cursos`.`id_curso`, `m`.`id_curso`
) CI_count_all_results
SELECT `cursos`.*, concat(f.nombres, " ", `f`.`paterno`, " ", f.materno) as nombre_facilitador, ifnull(count(m.id_curso), 0) as cantidad
FROM `cursos`
JOIN `facilitadores` as `f` ON `f`.`id_facilitador`= `cursos`.`id_facilitador`
LEFT JOIN `mae_capacitaciones` as `m` ON `m`.`id_curso` = `cursos`.`id_curso`
GROUP BY `cursos`.`id_curso`, `m`.`id_curso`
 LIMIT 5, 5
---
    public function index()
    {
        $cursos  = new CursosModel();
        $cursosData = $cursos->select('cursos.*,
        concat(f.nombres," ",f.paterno," ",f.materno) as nombre_facilitador,
        ifnull(count(m.id_curso),0) as cantidad')
            ->join('facilitadores as f', 'f.id_facilitador= cursos.id_facilitador')
            ->join('mae_capacitaciones as m', 'm.id_curso = cursos.id_curso', 'left')
            ->groupBy('cursos.id_curso , m.id_curso ')
            ->paginate(5);