app/Controllers/Seminarios/FacilitadoresController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `facilitadores`.*, ifnull(count(c.id_facilitador), 0) as cantidad
FROM `facilitadores`
LEFT JOIN `cursos` `c` ON `facilitadores`.`id_facilitador` = `c`.`id_facilitador`
GROUP BY `c`.`id_facilitador`
) CI_count_all_results
SELECT `facilitadores`.*, ifnull(count(c.id_facilitador), 0) as cantidad
FROM `facilitadores`
LEFT JOIN `cursos` `c` ON `facilitadores`.`id_facilitador` = `c`.`id_facilitador`
GROUP BY `c`.`id_facilitador`
 LIMIT 5
---
    public function index()
    {
        $facilitador  = new FacilitadorModel();
        $facilitadorData =  $facilitador->select('facilitadores.*,ifnull(count(c.id_facilitador),0) as cantidad')
            ->join('cursos c', 'facilitadores.id_facilitador = c.id_facilitador', 'left')
            ->groupBy('c.id_facilitador ')
            ->paginate(5);