app/Controllers/Seminarios/ParticipantesController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `participantes`.*, ifnull(count(d.id_det_capacitacion), 0) as cantidad
FROM `participantes`
LEFT JOIN `det_capacitaciones` `d` ON `participantes`.`id_participante` = `d`.`id_participante`
GROUP BY `participantes`.`id_participante`, `d`.`id_det_capacitacion`
) CI_count_all_results
SELECT `participantes`.*, ifnull(count(d.id_det_capacitacion), 0) as cantidad
FROM `participantes`
LEFT JOIN `det_capacitaciones` `d` ON `participantes`.`id_participante` = `d`.`id_participante`
GROUP BY `participantes`.`id_participante`, `d`.`id_det_capacitacion`
 LIMIT 5, 5
---
    public function index()
    {
        $participantes  = new ParticipantesModel();
        $data = [
            'title' => 'Participantes',
            'participantes' => $participantes->select('participantes.*,ifnull(count(d.id_det_capacitacion),0) as cantidad')
                ->join('det_capacitaciones d', 'participantes.id_participante = d.id_participante', 'left')
                ->groupBy('participantes.id_participante, d.id_det_capacitacion')
                ->paginate(5),