seminarios/app/Controllers/Seminarios/Capacitaciones/InscripcionesController.php

SELECT COUNT(*) AS `numrows`
FROM `det_capacitaciones`
JOIN `mae_capacitaciones` `m` ON `det_capacitaciones`.`id_mae_capacitacion` = `m`.`id_mae_capacitacion`
JOIN `participantes` `p` ON `det_capacitaciones`.`id_participante` = `p`.`id_participante`
JOIN `cursos` `c` ON `c`.`id_curso` = `m`.`id_curso`
SELECT `id_det_capacitacion`, concat(nombres, " ", `paterno`, " ", materno) as nombre_participante, `nombre_curso`
FROM `det_capacitaciones`
JOIN `mae_capacitaciones` `m` ON `det_capacitaciones`.`id_mae_capacitacion` = `m`.`id_mae_capacitacion`
JOIN `participantes` `p` ON `det_capacitaciones`.`id_participante` = `p`.`id_participante`
JOIN `cursos` `c` ON `c`.`id_curso` = `m`.`id_curso`
 LIMIT 5
---
    public function index()
    {
        $capacitacion  = new DetalleCapacitacionesModel();
        $capacitacionData = $capacitacion->select('id_det_capacitacion,  concat(nombres," ",paterno," ",materno) as nombre_participante ,nombre_curso')
            ->join('mae_capacitaciones m', 'det_capacitaciones.id_mae_capacitacion = m.id_mae_capacitacion')
            ->join('participantes p', 'det_capacitaciones.id_participante = p.id_participante ')
            ->join('cursos c', 'c.id_curso = m.id_curso')
            ->paginate(5);